CREATE TABLE apartments
(
	id int generated always as identity,
	address text NOT NULL UNIQUE,
	price NUMERIC,
    currency TEXT CHECK (currency IN ('USD', 'EUR', 'RUB'))
);
DROP TABLE apartments;

INSERT INTO apartments(address, price, currency) VALUES
		('138420, Ростовская область, город Пушкино, пр. Домодедовская, 02', 70_000.00, 'USD'),
		('774681, Новгородская область, город Наро-Фоминск, пл. Бухарестская, 39', 61_000.00, 'USD'),
		('392198, Новгородская область, город Можайск, ул. Гагарина, 81', 56_000.00, 'USD'),
		('418458, Саратовская область, город Подольск, спуск Гагарина, 56', 78_000.00, 'USD'),
		('165794, Амурская область, город Балашиха, наб. Домодедовская, 14', 96_000.00, 'USD'),
		('446477, Калужская область, город Егорьевск, спуск Славы, 71', 103_000.00, 'USD'),
		('302869, Тверская область, город Волоколамск, шоссе 1905 года, 33', 58_000.00, 'USD')
